espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_struct.h
/** Type of slc_host_slc1host_int_raw register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc1_tohost_bit0_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit0_int_raw:1;
        /** slchost_slc1_tohost_bit1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit1_int_raw:1;
        /** slchost_slc1_tohost_bit2_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit2_int_raw:1;
        /** slchost_slc1_tohost_bit3_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit3_int_raw:1;
        /** slchost_slc1_tohost_bit4_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit4_int_raw:1;
        /** slchost_slc1_tohost_bit5_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit5_int_raw:1;
        /** slchost_slc1_tohost_bit6_int_raw : R/WTC/SS/SC; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit6_int_raw:1;
        /** slchost_slc1_tohost_bit7_int_raw : R/WTC/SS/SC; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tohost_bit7_int_raw:1;
        /** slchost_slc1_token0_1to0_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_token0_1to0_int_raw:1;
        /** slchost_slc1_token1_1to0_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_token1_1to0_int_raw:1;
        /** slchost_slc1_token0_0to1_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_token0_0to1_int_raw:1;
        /** slchost_slc1_token1_0to1_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_token1_0to1_int_raw:1;
        /** slchost_slc1host_rx_sof_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_rx_sof_int_raw:1;
        /** slchost_slc1host_rx_eof_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_rx_eof_int_raw:1;
        /** slchost_slc1host_rx_start_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_rx_start_int_raw:1;
        /** slchost_slc1host_tx_start_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_tx_start_int_raw:1;
        /** slchost_slc1_rx_udf_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_rx_udf_int_raw:1;
        /** slchost_slc1_tx_ovf_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_tx_ovf_int_raw:1;
        /** slchost_slc1_rx_pf_valid_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_rx_pf_valid_int_raw:1;
        /** slchost_slc1_ext_bit0_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_ext_bit0_int_raw:1;
        /** slchost_slc1_ext_bit1_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_ext_bit1_int_raw:1;
        /** slchost_slc1_ext_bit2_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_ext_bit2_int_raw:1;
        /** slchost_slc1_ext_bit3_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_ext_bit3_int_raw:1;
        /** slchost_slc1_wifi_rx_new_packet_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_wifi_rx_new_packet_int_raw:1;
        /** slchost_slc1_host_rd_retry_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_host_rd_retry_int_raw:1;
        /** slchost_slc1_bt_rx_new_packet_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_bt_rx_new_packet_int_raw:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc1host_int_raw_reg_t;

/** Type of slc_host_slc0host_int_st register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc0_tohost_bit0_int_st : RO; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit0_int_st:1;
        /** slchost_slc0_tohost_bit1_int_st : RO; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit1_int_st:1;
        /** slchost_slc0_tohost_bit2_int_st : RO; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit2_int_st:1;
        /** slchost_slc0_tohost_bit3_int_st : RO; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit3_int_st:1;
        /** slchost_slc0_tohost_bit4_int_st : RO; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit4_int_st:1;
        /** slchost_slc0_tohost_bit5_int_st : RO; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit5_int_st:1;
        /** slchost_slc0_tohost_bit6_int_st : RO; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit6_int_st:1;
        /** slchost_slc0_tohost_bit7_int_st : RO; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit7_int_st:1;
        /** slchost_slc0_token0_1to0_int_st : RO; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token0_1to0_int_st:1;
        /** slchost_slc0_token1_1to0_int_st : RO; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token1_1to0_int_st:1;
        /** slchost_slc0_token0_0to1_int_st : RO; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token0_0to1_int_st:1;
        /** slchost_slc0_token1_0to1_int_st : RO; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token1_0to1_int_st:1;
        /** slchost_slc0host_rx_sof_int_st : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_sof_int_st:1;
        /** slchost_slc0host_rx_eof_int_st : RO; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_eof_int_st:1;
        /** slchost_slc0host_rx_start_int_st : RO; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_start_int_st:1;
        /** slchost_slc0host_tx_start_int_st : RO; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_tx_start_int_st:1;
        /** slchost_slc0_rx_udf_int_st : RO; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_udf_int_st:1;
        /** slchost_slc0_tx_ovf_int_st : RO; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tx_ovf_int_st:1;
        /** slchost_slc0_rx_pf_valid_int_st : RO; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_pf_valid_int_st:1;
        /** slchost_slc0_ext_bit0_int_st : RO; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit0_int_st:1;
        /** slchost_slc0_ext_bit1_int_st : RO; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit1_int_st:1;
        /** slchost_slc0_ext_bit2_int_st : RO; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit2_int_st:1;
        /** slchost_slc0_ext_bit3_int_st : RO; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit3_int_st:1;
        /** slchost_slc0_rx_new_packet_int_st : RO; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_new_packet_int_st:1;
        /** slchost_slc0_host_rd_retry_int_st : RO; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_host_rd_retry_int_st:1;
        /** slchost_gpio_sdio_int_st : RO; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_gpio_sdio_int_st:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc0host_int_st_reg_t;

