espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_struct.h
/** Type of slc_host_state_w1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_state4 : RO; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_state4:8;
        /** slchost_slchost_state5 : RO; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_state5:8;
        /** slchost_slchost_state6 : RO; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_state6:8;
        /** slchost_slchost_state7 : RO; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_state7:8;
    };
    uint32_t val;
} sdio_slc_host_state_w1_reg_t;

/** Type of slc_host_conf_w0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf0 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf0:8;
        /** slchost_slchost_conf1 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf1:8;
        /** slchost_slchost_conf2 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf2:8;
        /** slchost_slchost_conf3 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf3:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w0_reg_t;

/** Type of slc_host_conf_w1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf4 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf4:8;
        /** slchost_slchost_conf5 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf5:8;
        /** slchost_slchost_conf6 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf6:8;
        /** slchost_slchost_conf7 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf7:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w1_reg_t;

/** Type of slc_host_conf_w2 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf8 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf8:8;
        /** slchost_slchost_conf9 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf9:8;
        /** slchost_slchost_conf10 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf10:8;
        /** slchost_slchost_conf11 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf11:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w2_reg_t;

/** Type of slc_host_conf_w3 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf12 : R/W; bitpos: [7:0]; default: 192;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf12:8;
        /** slchost_slchost_conf13 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf13:8;
        /** slchost_slchost_conf14 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf14:8;
        /** slchost_slchost_conf15 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf15:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w3_reg_t;

/** Type of slc_host_conf_w4 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf16 : R/W; bitpos: [7:0]; default: 255;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf16:8;
        /** slchost_slchost_conf17 : R/W; bitpos: [15:8]; default: 1;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf17:8;
        /** slchost_slchost_conf18 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf18:8;
        /** slchost_slchost_conf19 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf19:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w4_reg_t;

/** Type of slc_host_conf_w5 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf20 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf20:8;
        /** slchost_slchost_conf21 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf21:8;
        /** slchost_slchost_conf22 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf22:8;
        /** slchost_slchost_conf23 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf23:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w5_reg_t;

/** Type of slc_host_win_cmd register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_win_cmd : R/W; bitpos: [15:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_win_cmd:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} sdio_slc_host_win_cmd_reg_t;

/** Type of slc_host_conf_w6 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf24 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf24:8;
        /** slchost_slchost_conf25 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf25:8;
        /** slchost_slchost_conf26 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf26:8;
        /** slchost_slchost_conf27 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf27:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w6_reg_t;

/** Type of slc_host_conf_w7 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf28 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf28:8;
        /** slchost_slchost_conf29 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf29:8;
        /** slchost_slchost_conf30 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf30:8;
        /** slchost_slchost_conf31 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf31:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w7_reg_t;

