espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_struct.h
/** Type of slc_host_pkt_len0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_hostslchost_slc0_len0 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len0:20;
        /** slchost_hostslchost_slc0_len0_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len0_check:12;
    };
    uint32_t val;
} sdio_slc_host_pkt_len0_reg_t;

/** Type of slc_host_pkt_len1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_hostslchost_slc0_len1 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len1:20;
        /** slchost_hostslchost_slc0_len1_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len1_check:12;
    };
    uint32_t val;
} sdio_slc_host_pkt_len1_reg_t;

/** Type of slc_host_pkt_len2 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_hostslchost_slc0_len2 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len2:20;
        /** slchost_hostslchost_slc0_len2_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc0_len2_check:12;
    };
    uint32_t val;
} sdio_slc_host_pkt_len2_reg_t;

/** Type of slc_host_conf_w8 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf32 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf32:8;
        /** slchost_slchost_conf33 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf33:8;
        /** slchost_slchost_conf34 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf34:8;
        /** slchost_slchost_conf35 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf35:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w8_reg_t;

/** Type of slc_host_conf_w9 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf36 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf36:8;
        /** slchost_slchost_conf37 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf37:8;
        /** slchost_slchost_conf38 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf38:8;
        /** slchost_slchost_conf39 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf39:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w9_reg_t;

/** Type of slc_host_conf_w10 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf40 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf40:8;
        /** slchost_slchost_conf41 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf41:8;
        /** slchost_slchost_conf42 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf42:8;
        /** slchost_slchost_conf43 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf43:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w10_reg_t;

/** Type of slc_host_conf_w11 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf44 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf44:8;
        /** slchost_slchost_conf45 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf45:8;
        /** slchost_slchost_conf46 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf46:8;
        /** slchost_slchost_conf47 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf47:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w11_reg_t;

/** Type of slc_host_conf_w12 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf48 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf48:8;
        /** slchost_slchost_conf49 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf49:8;
        /** slchost_slchost_conf50 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf50:8;
        /** slchost_slchost_conf51 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf51:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w12_reg_t;

/** Type of slc_host_conf_w13 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf52 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf52:8;
        /** slchost_slchost_conf53 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf53:8;
        /** slchost_slchost_conf54 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf54:8;
        /** slchost_slchost_conf55 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf55:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w13_reg_t;

/** Type of slc_host_conf_w14 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf56 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf56:8;
        /** slchost_slchost_conf57 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf57:8;
        /** slchost_slchost_conf58 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf58:8;
        /** slchost_slchost_conf59 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf59:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w14_reg_t;

/** Type of slc_host_conf_w15 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_conf60 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf60:8;
        /** slchost_slchost_conf61 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf61:8;
        /** slchost_slchost_conf62 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_conf62:8;
        /** slchost_slchost_conf63 : R/W; bitpos: [31:24]; default: 0;
         *  Bit [27:24] used for reg_slc_apbwin_addr[31:28]
         */
        uint32_t slchost_slchost_conf63:8;
    };
    uint32_t val;
} sdio_slc_host_conf_w15_reg_t;

