espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_struct.h
/** Type of slc_host_check_sum0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_check_sum0 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slchost_check_sum0:32;
    };
    uint32_t val;
} sdio_slc_host_check_sum0_reg_t;

/** Type of slc_host_check_sum1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slchost_check_sum1 : RO; bitpos: [31:0]; default: 319;
         *  *******Description***********
         */
        uint32_t slchost_slchost_check_sum1:32;
    };
    uint32_t val;
} sdio_slc_host_check_sum1_reg_t;

/** Type of slc_host_slc1host_token_rdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc1_token0 : RO; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_token0:12;
        /** slchost_slc1_rx_pf_valid : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_rx_pf_valid:1;
        uint32_t reserved_13:3;
        /** slchost_hostslchost_slc1_token1 : RO; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hostslchost_slc1_token1:12;
        /** slchost_slc1_rx_pf_eof : RO; bitpos: [31:28]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1_rx_pf_eof:4;
    };
    uint32_t val;
} sdio_slc_host_slc1host_token_rdata_reg_t;

/** Type of slc_host_slc0host_token_wdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc0host_token0_wd : R/W; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token0_wd:12;
        uint32_t reserved_12:4;
        /** slchost_slc0host_token1_wd : R/W; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token1_wd:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_host_slc0host_token_wdata_reg_t;

/** Type of slc_host_slc1host_token_wdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc1host_token0_wd : R/W; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token0_wd:12;
        uint32_t reserved_12:4;
        /** slchost_slc1host_token1_wd : R/W; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token1_wd:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_host_slc1host_token_wdata_reg_t;

/** Type of slc_host_token_con register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc0host_token0_dec : WT; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token0_dec:1;
        /** slchost_slc0host_token1_dec : WT; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token1_dec:1;
        /** slchost_slc0host_token0_wr : WT; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token0_wr:1;
        /** slchost_slc0host_token1_wr : WT; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_token1_wr:1;
        /** slchost_slc1host_token0_dec : WT; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token0_dec:1;
        /** slchost_slc1host_token1_dec : WT; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token1_dec:1;
        /** slchost_slc1host_token0_wr : WT; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token0_wr:1;
        /** slchost_slc1host_token1_wr : WT; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc1host_token1_wr:1;
        /** slchost_slc0host_len_wr : WT; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_len_wr:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} sdio_slc_host_token_con_reg_t;

/** Type of slc_host_slc0host_int_clr register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc0_tohost_bit0_int_clr : WT; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit0_int_clr:1;
        /** slchost_slc0_tohost_bit1_int_clr : WT; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit1_int_clr:1;
        /** slchost_slc0_tohost_bit2_int_clr : WT; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit2_int_clr:1;
        /** slchost_slc0_tohost_bit3_int_clr : WT; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit3_int_clr:1;
        /** slchost_slc0_tohost_bit4_int_clr : WT; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit4_int_clr:1;
        /** slchost_slc0_tohost_bit5_int_clr : WT; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit5_int_clr:1;
        /** slchost_slc0_tohost_bit6_int_clr : WT; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit6_int_clr:1;
        /** slchost_slc0_tohost_bit7_int_clr : WT; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tohost_bit7_int_clr:1;
        /** slchost_slc0_token0_1to0_int_clr : WT; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token0_1to0_int_clr:1;
        /** slchost_slc0_token1_1to0_int_clr : WT; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token1_1to0_int_clr:1;
        /** slchost_slc0_token0_0to1_int_clr : WT; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token0_0to1_int_clr:1;
        /** slchost_slc0_token1_0to1_int_clr : WT; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_token1_0to1_int_clr:1;
        /** slchost_slc0host_rx_sof_int_clr : WT; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_sof_int_clr:1;
        /** slchost_slc0host_rx_eof_int_clr : WT; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_eof_int_clr:1;
        /** slchost_slc0host_rx_start_int_clr : WT; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_rx_start_int_clr:1;
        /** slchost_slc0host_tx_start_int_clr : WT; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0host_tx_start_int_clr:1;
        /** slchost_slc0_rx_udf_int_clr : WT; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_udf_int_clr:1;
        /** slchost_slc0_tx_ovf_int_clr : WT; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_tx_ovf_int_clr:1;
        /** slchost_slc0_rx_pf_valid_int_clr : WT; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_pf_valid_int_clr:1;
        /** slchost_slc0_ext_bit0_int_clr : WT; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit0_int_clr:1;
        /** slchost_slc0_ext_bit1_int_clr : WT; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit1_int_clr:1;
        /** slchost_slc0_ext_bit2_int_clr : WT; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit2_int_clr:1;
        /** slchost_slc0_ext_bit3_int_clr : WT; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_ext_bit3_int_clr:1;
        /** slchost_slc0_rx_new_packet_int_clr : WT; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_rx_new_packet_int_clr:1;
        /** slchost_slc0_host_rd_retry_int_clr : WT; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_slc0_host_rd_retry_int_clr:1;
        /** slchost_gpio_sdio_int_clr : WT; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_gpio_sdio_int_clr:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc0host_int_clr_reg_t;

