espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_struct.h
/** Type of slc_host_conf register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_frc_sdio11 : R/W; bitpos: [4:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_frc_sdio11:5;
        /** slchost_frc_sdio20 : R/W; bitpos: [9:5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_frc_sdio20:5;
        /** slchost_frc_neg_samp : R/W; bitpos: [14:10]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_frc_neg_samp:5;
        /** slchost_frc_pos_samp : R/W; bitpos: [19:15]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_frc_pos_samp:5;
        /** slchost_frc_quick_in : R/W; bitpos: [24:20]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_frc_quick_in:5;
        /** slchost_sdio20_int_delay : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_sdio20_int_delay:1;
        /** slchost_sdio_pad_pullup : R/W; bitpos: [26]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_sdio_pad_pullup:1;
        /** slchost_hspeed_con_en : R/W; bitpos: [27]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_hspeed_con_en:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_host_conf_reg_t;

/** Type of slc_host_inf_st register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_sdio20_mode : RO; bitpos: [4:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_sdio20_mode:5;
        /** slchost_sdio_neg_samp : RO; bitpos: [9:5]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_sdio_neg_samp:5;
        /** slchost_sdio_quick_in : RO; bitpos: [14:10]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_sdio_quick_in:5;
        /** slchost_dll_on_sw : R/W; bitpos: [15]; default: 0;
         *  dll is controlled by software
         */
        uint32_t slchost_dll_on_sw:1;
        /** slchost_dll_on : R/W; bitpos: [16]; default: 0;
         *  Software dll on
         */
        uint32_t slchost_dll_on:1;
        /** slchost_clk_mode_sw : R/W; bitpos: [17]; default: 0;
         *  dll clock mode is controlled by software
         */
        uint32_t slchost_clk_mode_sw:1;
        /** slchost_clk_mode : R/W; bitpos: [19:18]; default: 0;
         *  Software set clock mode
         */
        uint32_t slchost_clk_mode:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sdio_slc_host_inf_st_reg_t;


typedef struct {
    uint32_t reserved_000[4];
    volatile sdio_slc_host_func2_0_reg_t slc_host_func2_0;
    volatile sdio_slc_host_func2_1_reg_t slc_host_func2_1;
    uint32_t reserved_018[2];
    volatile sdio_slc_host_func2_2_reg_t slc_host_func2_2;
    uint32_t reserved_024[4];
    volatile sdio_slc_host_gpio_status0_reg_t slc_host_gpio_status0;
    volatile sdio_slc_host_gpio_status1_reg_t slc_host_gpio_status1;
    volatile sdio_slc_host_gpio_in0_reg_t slc_host_gpio_in0;
    volatile sdio_slc_host_gpio_in1_reg_t slc_host_gpio_in1;
    volatile sdio_slc_host_slc0host_token_rdata_reg_t slc_host_slc0host_token_rdata;
    volatile sdio_slc_host_slc0_host_pf_reg_t slc_host_slc0_host_pf;
    volatile sdio_slc_host_slc1_host_pf_reg_t slc_host_slc1_host_pf;
    volatile sdio_slc_host_slc0host_int_raw_reg_t slc_host_slc0host_int_raw;
    volatile sdio_slc_host_slc1host_int_raw_reg_t slc_host_slc1host_int_raw;
    volatile sdio_slc_host_slc0host_int_st_reg_t slc_host_slc0host_int_st;
    volatile sdio_slc_host_slc1host_int_st_reg_t slc_host_slc1host_int_st;
    volatile sdio_slc_host_pkt_len_reg_t slc_host_pkt_len;
    volatile sdio_slc_host_state_w0_reg_t slc_host_state_w0;
    volatile sdio_slc_host_state_w1_reg_t slc_host_state_w1;
    volatile sdio_slc_host_conf_w0_reg_t slc_host_conf_w0;
    volatile sdio_slc_host_conf_w1_reg_t slc_host_conf_w1;
    volatile sdio_slc_host_conf_w2_reg_t slc_host_conf_w2;
    volatile sdio_slc_host_conf_w3_reg_t slc_host_conf_w3;
    volatile sdio_slc_host_conf_w4_reg_t slc_host_conf_w4;
    volatile sdio_slc_host_conf_w5_reg_t slc_host_conf_w5;
    volatile sdio_slc_host_win_cmd_reg_t slc_host_win_cmd;
    volatile sdio_slc_host_conf_w6_reg_t slc_host_conf_w6;
    volatile sdio_slc_host_conf_w7_reg_t slc_host_conf_w7;
    volatile sdio_slc_host_pkt_len0_reg_t slc_host_pkt_len0;
    volatile sdio_slc_host_pkt_len1_reg_t slc_host_pkt_len1;
    volatile sdio_slc_host_pkt_len2_reg_t slc_host_pkt_len2;
    volatile sdio_slc_host_conf_w8_reg_t slc_host_conf_w8;
    volatile sdio_slc_host_conf_w9_reg_t slc_host_conf_w9;
    volatile sdio_slc_host_conf_w10_reg_t slc_host_conf_w10;
    volatile sdio_slc_host_conf_w11_reg_t slc_host_conf_w11;
    volatile sdio_slc_host_conf_w12_reg_t slc_host_conf_w12;
    volatile sdio_slc_host_conf_w13_reg_t slc_host_conf_w13;
    volatile sdio_slc_host_conf_w14_reg_t slc_host_conf_w14;
    volatile sdio_slc_host_conf_w15_reg_t slc_host_conf_w15;
    volatile sdio_slc_host_check_sum0_reg_t slc_host_check_sum0;
    volatile sdio_slc_host_check_sum1_reg_t slc_host_check_sum1;
    volatile sdio_slc_host_slc1host_token_rdata_reg_t slc_host_slc1host_token_rdata;
    volatile sdio_slc_host_slc0host_token_wdata_reg_t slc_host_slc0host_token_wdata;
    volatile sdio_slc_host_slc1host_token_wdata_reg_t slc_host_slc1host_token_wdata;
    volatile sdio_slc_host_token_con_reg_t slc_host_token_con;
    volatile sdio_slc_host_slc0host_int_clr_reg_t slc_host_slc0host_int_clr;
    volatile sdio_slc_host_slc1host_int_clr_reg_t slc_host_slc1host_int_clr;
    volatile sdio_slc_host_slc0host_func1_int_ena_reg_t slc_host_slc0host_func1_int_ena;
    volatile sdio_slc_host_slc1host_func1_int_ena_reg_t slc_host_slc1host_func1_int_ena;
    volatile sdio_slc_host_slc0host_func2_int_ena_reg_t slc_host_slc0host_func2_int_ena;
    volatile sdio_slc_host_slc1host_func2_int_ena_reg_t slc_host_slc1host_func2_int_ena;
    volatile sdio_slc_host_slc0host_int_ena_reg_t slc_host_slc0host_int_ena;
    volatile sdio_slc_host_slc1host_int_ena_reg_t slc_host_slc1host_int_ena;
    volatile sdio_slc_host_slc0host_rx_infor_reg_t slc_host_slc0host_rx_infor;
    volatile sdio_slc_host_slc1host_rx_infor_reg_t slc_host_slc1host_rx_infor;
    volatile sdio_slc_host_slc0host_len_wd_reg_t slc_host_slc0host_len_wd;
    volatile sdio_slc_host_slc_apbwin_wdata_reg_t slc_host_slc_apbwin_wdata;
    volatile sdio_slc_host_slc_apbwin_conf_reg_t slc_host_slc_apbwin_conf;
    volatile sdio_slc_host_slc_apbwin_rdata_reg_t slc_host_slc_apbwin_rdata;
    volatile sdio_slc_host_rdclr0_reg_t slc_host_rdclr0;
    volatile sdio_slc_host_rdclr1_reg_t slc_host_rdclr1;
    volatile sdio_slc_host_slc0host_int_ena1_reg_t slc_host_slc0host_int_ena1;
    volatile sdio_slc_host_slc1host_int_ena1_reg_t slc_host_slc1host_int_ena1;
    uint32_t reserved_11c[23];
    volatile sdio_slc_host_date_reg_t slc_host_date;
    volatile sdio_slc_host_id_reg_t slc_host_id;
    uint32_t reserved_180[28];
    volatile sdio_slc_host_conf_reg_t slc_host_conf;
    volatile sdio_slc_host_inf_st_reg_t slc_host_inf_st;
} host_dev_t;

extern host_dev_t HOST;

#ifndef __cplusplus
_Static_assert(sizeof(host_dev_t) == 0x1f8, "Invalid size of host_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
